/**
 * js正则表达式库--Regs.js
 * @by denghao.me
 * @date    2017-02-11 18:09:35
 */

var Regs = {

  /*
   * 数字相关
   */
  //正整数
  posiInt: /^[1-9]\d*$/,

  //0或正整数
  posiInt0: /^(0|[1-9][0-9]*)$/,

  //2位的数字
  numLen2: /^[0-9]{2}$/,

  // 2-3位的数字：
  numLen2or3: /^\d{1,3}$/,

  // 非零开头的最多带两位小数的正数：
  posiFloat2: /^([1-9][0-9]*)+(.[0-9]{1,2})?$/,

  // 带1-2位小数的正数或负数：
  float1or2: /^(\-)?\d+(\.\d{1,2})?$/,

  // 非零的负整数：
  negativeInt: /^-[1-9]\d*$/,

  // 非正整数：
  negativeInt0: /^-[1-9]\d*|0$/,

  // 非负浮点数：
  posifloat0: /^\d+(\.\d+)?$/,

  // 非正浮点数：
  negativeFloat0: /^((-\d+(\.\d+)?)|(0+(\.0+)?))$/,

  // 负浮点数：
  negativeFloat: /^-([1-9]\d*\.\d*|0\.\d*[1-9]\d*)$/,

  // 正浮点数：
  posiFloat: /^[1-9]\d*\.\d*|0\.\d*[1-9]\d*$/,

  // 浮点数：
  float: /^(-?\d+)(\.\d+)?$/,


  /*
   * 字符相关
   */

  // 英文和数字：
  numEn: /^[A-Za-z0-9]+$/,

  // 长度为4-16的所有字符：
  en4to16: /^.{4,16}$/,

  // 英文字母：
  En: /^[A-Za-z]+$/,

  // 大写英文字母：
  EN: /^[A-Z]+$/,

  // 小写英文字母：
  en: /^[a-z]+$/,

  // 数字、字母、下划线
  numEn_: /^\w+$/,

  // 中文、英文、数字、下划线：
  numEnCn_: /^[\u4E00-\u9FA5A-Za-z0-9_]+$/,

  // 中文、英文、数字：
  numEnCn: /^[\u4E00-\u9FA5A-Za-z0-9]+$/,

  // 含有^%&',;=?$\”等字符：
  illegal: /[^%&',;=?$\x22]+/,

  // Email地址：
  email: /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/,

  // url:

  // 手机号码：
  mobile: /^1[34578]\d{9}$/,

  // 座机号码:
  telephone: /^(($\d{3,4}-)|\d{3.4}-)?\d{7,8}$/,

  // 身份证号(15位、18位数字)：
  idCard: /^([0-9]){7,18}(x|X)?$/,


  // 日期格式：2017-1-1
  date: /^\d{4}-\d{1,2}-\d{1,2}/,

  // 一年的12个月(01～09和1～12)：
  month: /^(0?[1-9]|1[0-2])$/,

  // 一个月的31天(01～09和1～31)：
  day: /^((0?[1-9])|((1|2)[0-9])|30|31)$/,

  // xml文件：
  xml: /^([a-zA-Z]+-?)+[a-zA-Z0-9]+\\.[x|X][m|M][l|L]$/,

  //HTML标记：

  //首尾空白字符：
  trim: /^\s*|\s*$/,

  //腾讯QQ号：
  qq: /[1-9][0-9]{4,}/,

  //中国邮政编码：
  postcode: /[1-9]\d{5}(?!\d)/,

  //IP地址：
  ip: /\d+\.\d+\.\d+\.\d+/

}